app/Controllers/Users.php

    public function update_form($id){
        $usuarios = New UsuarioModel();
        $data['user'] = $usuarios->where('id',$id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1